// Щоб дочекатися закінчення декількох горутин, ми можемо
// використовувати *групу очікування*.

package main

import (
	"fmt"
	"sync"
	"time"
)

// Це функція, яку ми будемо виконувати в кожній горутині.
// Зауважте, що WaitGroup має бути передана функціям через
// покажчик.
func worker(id int, wg *sync.WaitGroup) {
	fmt.Printf("Воркер %d стартує\n", id)

	// Запустимо функцію Sleep, щоб імітувати вартісний таск.
	time.Sleep(time.Second)
	fmt.Printf("Воркер %d завершено\n", id)

	// Повідомимо WaitGroup, що цей воркер завершено.
	wg.Done()
}

func main() {

	// Ця група WaitGroup використовується для очікування завершення
	// всіх горутин, запущених тут.
	var wg sync.WaitGroup

	// Запустимо декілька горутин і інкрементуємо лічильник WaitGroup
	// для кожної.
	for i := 1; i <= 5; i++ {
		wg.Add(1)
		go worker(i, &wg)
	}

	// Блокуємо, поки лічильник у WaitGroup не впаде до 0;
	// тобто всі воркери повідомлять, що вони завершились.
	wg.Wait()
}
