// Go'шний _select_ (вибір) дозволяє вам очікувати операцій з
// кількома каналами. Комбінування горутин та каналів з _select_
// це надзвичайно корисна особливість Go.

package main

import (
	"fmt"
	"time"
)

func main() {

	// Наприклад - ми хочемо обирати поміж двох каналів.
	c1 := make(chan string)
	c2 := make(chan string)

	// Кожен канал отримає значення після якогось проміжку часу,
	// так ми симулюємо, скажімо, блокуючі виклики від сторонніх
	// сервісів, що виконуються одночасних горутинах.
	go func() {
		time.Sleep(1 * time.Second)
		c1 <- "один"
	}()
	go func() {
		time.Sleep(2 * time.Second)
		c2 <- "два"
	}()

	// Ми застосуємо `select` для очікування обох значень
	// одночасно, передавши повідомлення на екран - відразу
	// по-отриманні.
	for i := 0; i < 2; i++ {
		select {
		case msg1 := <-c1:
			fmt.Println("отримано", msg1)
		case msg2 := <-c2:
			fmt.Println("отримано", msg2)
		}
	}
}
