// В Go, _змінні_ декларуються явно і використовуються
// компілятором, наприклад, для перевірки коректності типу
// у викликах функцій.

package main

import "fmt"

func main() {

	// Ключове слово `var` декларує одну або більше змінних.
	var a = "initiaal"
	fmt.Println(a)

	// Дозволяється декларувати понад одну змінну водночас.
	var b, c int = 1, 2
	fmt.Println(b, c)

	// Go дозволяє припускати тип змінної, відштовхуючись від її значення.
	var d = true
	fmt.Println(d)

	// Змінні декларовані без супровідної ініціалізації
	// мають _нульове значення_. Наприклад, нульовим
	// значенням для цілих чисел (`int`) є 0 (нуль).
	var e int
	fmt.Println(e)

	// Синтаксис `:=` це скорочення для декларації та ініціалізації
	// змінної в один рядок (<nobr>`var f string = "short"`</nobr> в нашому випадку).
	f := "short"
	fmt.Println(f)
}
